app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."department" = ?  [["department", "IT Support"]]
---
    def index
      if current_user.admin?
        @tickets = Ticket.all
      else
       @tickets = Ticket.where(department: current_user.role)

INSERT INTO "tickets" ("title", "description", "category", "user_id", "created_at", "updated_at", "department") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      @ticket = current_user.tickets.build(ticket_params)
      if @ticket.save